In [1]:
import pandas as pd
import numpy as np
surveys = pd.read_csv('../Labs files/course-files/StackOverflowDeveloperSurvey2018.csv',
                      low_memory=False,
                  usecols=['Country','Gender','OperatingSystem'])
surveys.head()

          Country OperatingSystem Gender
0           Kenya     Linux-based   Male
1  United Kingdom     Linux-based   Male
2   United States             NaN    NaN
3   United States         Windows   Male
4    South Africa         Windows   Male

In [2]:
surveys['Country'].is_unique

False

In [3]:
surveys['Country'].nunique() #does not count NaN in

183

In [7]:
n = surveys['Country'].unique()
len(n) #includes Nan

184

In [22]:
dup_kee_first = ~surveys['Country'].duplicated(keep='first')

In [23]:
dup_kee_first

0         True
1         True
2         True
3        False
4         True
         ...
98850    False
98851    False
98852    False
98853    False
98854    False
Name: Country, Length: 98855, dtype: bool

In [26]:
surveys[dup_kee_first].head()

          Country OperatingSystem  Gender
0           Kenya     Linux-based    Male
1  United Kingdom     Linux-based    Male
2   United States             NaN     NaN
4    South Africa         Windows    Male
7         Nigeria         Windows  Female

In [28]:
surveys[dup_kee_first].shape

(184, 3)

In [31]:
surveys.drop_duplicates(subset=['Country','OperatingSystem']).head()

          Country OperatingSystem Gender
0           Kenya     Linux-based   Male
1  United Kingdom     Linux-based   Male
2   United States             NaN    NaN
3   United States         Windows   Male
4    South Africa         Windows   Male

In [33]:
poland = surveys['Country'].isin(['Poland'])

In [34]:
surveys[poland]

      Country OperatingSystem Gender
30     Poland     Linux-based   Male
34     Poland         Windows   Male
90     Poland         Windows   Male
119    Poland         Windows    NaN
131    Poland     Linux-based   Male
...       ...             ...    ...
98784  Poland             NaN    NaN
98785  Poland             NaN    NaN
98811  Poland             NaN    NaN
98834  Poland             NaN    NaN
98838  Poland             NaN    NaN

[2122 rows x 3 columns]